#### SetValueAsDoubles Method

---

|  |
| --- |
| AssetPropertyDoubleArray4d Class   See Also |

Sets the value of the property.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public void SetValueAsDoubles( 	IList<double> value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetValueAsDoubles ( _ 	value As IList(Of Double) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetValueAsDoubles( 	IList<double>^ value ) ``` |

#### Parameters

value
:   Type:  System.Collections.Generic IList   Double
     The new value as doubles.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input value is invalid for this AssetPropertyDoubleArray4d property. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The asset property is not editable. |

# See Also

AssetPropertyDoubleArray4d Class

Autodesk.Revit.DB.Visual Namespace